@mcalster I've merged master into the feature branch and tested in its current (flattened) state, I've then reverted the flattening to bring it back to the nested structure and tested that.  Both versions generally work though there are still some niggles - unfortunately the v5 library didn't resolve the issue I found before.

So with the nested version of the provider I can initially create a log stream with no problems:
```
  # auth0_log_stream.log_stream will be created
  + resource "auth0_log_stream" "log_stream" {
      + id     = (known after apply)
      + name   = "Auth0Events"
      + status = (known after apply)
      + type   = "eventbridge"

      + sink {
          + aws_account_id           = (sensitive value)
          + aws_partner_event_source = (known after apply)
          + aws_region               = (sensitive value)
          + azure_partner_topic      = (known after apply)
        }
    }
```
If I then tweak the name to cause an update, the `http_custom_headers` and `splunk_secure` properties now appear:
```
  # auth0_log_stream.log_stream will be updated in-place
  ~ resource "auth0_log_stream" "log_stream" {
        id     = "<REDACTED>"
      ~ name   = "Auth0Events" -> "Auth0Events1"
        status = "active"
        type   = "eventbridge"

        sink {
            aws_account_id           = (sensitive value)
            aws_partner_event_source = "<REDACTED>"
            aws_region               = (sensitive value)
            http_custom_headers      = []
            splunk_secure            = false
        }
    }
```
When attempting to apply I get the following error:
```
Error: 400 Bad Request: Payload validation error: 'Data does not match any schemas from 'oneOf'' on property sink.

  on auth0_log_stream.tf line 1, in resource "auth0_log_stream" "log_stream":
   1: resource "auth0_log_stream" "log_stream" {
```
I instead change the region, to force a recreate, which I believe worked before:
```
  # auth0_log_stream.log_stream must be replaced
-/+ resource "auth0_log_stream" "log_stream" {
      ~ id     = "<REDACTED>" -> (known after apply)
        name   = "Auth0Events"
      ~ status = "active" -> (known after apply)
        type   = "eventbridge"

      ~ sink {
            aws_account_id           = (sensitive value)
          ~ aws_partner_event_source = "<REDACTED>" -> (known after apply)
          ~ aws_region               = (sensitive value)
          + azure_partner_topic      = (known after apply)
          - http_custom_headers      = [] -> null
          - splunk_secure            = false -> null
        }
    }
```
This succeeds in deleting the log stream, but creating the new one fails, with the same error:
```
Error: 400 Bad Request: Payload validation error: 'Data does not match any schemas from 'oneOf''.

  on auth0_log_stream.tf line 1, in resource "auth0_log_stream" "log_stream":
   1: resource "auth0_log_stream" "log_stream" {
```

A subsequent apply works, seemingly because by this point Terraform knows that the resource has been deleted, and starts from scratch in creating it again.

Removing the log stream in my Terraform code results in a successful deletion, though you can again see that those properties are unexpectedly set:
```
  # auth0_log_stream.log_stream will be destroyed
  - resource "auth0_log_stream" "log_stream" {
      - id     = "lst_0000000000001089" -> null
      - name   = "Auth0Events" -> null
      - status = "active" -> null
      - type   = "eventbridge" -> null

      - sink {
          - aws_account_id           = (sensitive value)
          - aws_partner_event_source = "aws.partner/auth0.com/redmatter-dev01-4da38e92-1c08-4277-9253-c92ebe093c6c/auth0.logs" -> null
          - aws_region               = (sensitive value)
          - http_custom_headers      = [] -> null
          - splunk_secure            = false -> null
        }
    }
```

Switching to the flattened version of the provider, creation works:
```
  # auth0_log_stream.log_stream will be created
  + resource "auth0_log_stream" "log_stream" {
      + aws_account_id           = (sensitive value)
      + aws_partner_event_source = (known after apply)
      + aws_region               = (sensitive value)
      + azure_partner_topic      = (known after apply)
      + id                       = (known after apply)
      + name                     = "Auth0Events"
      + status                   = (known after apply)
      + type                     = "eventbridge"
    }
```
And interestingly, the update doesn't show those extra properties:
```
  # auth0_log_stream.log_stream will be updated in-place
  ~ resource "auth0_log_stream" "log_stream" {
        aws_account_id           = (sensitive value)
        aws_partner_event_source = "<REDACTED>"
        aws_region               = (sensitive value)
        id                       = "<REDACTED>"
      ~ name                     = "Auth0Events" -> "Auth0Events1"
        status                   = "active"
        type                     = "eventbridge"
    }
```
But on applying, it does still fail in the same way:
```
Error: 400 Bad Request: Payload validation error: 'Data does not match any schemas from 'oneOf'' on property sink.

  on auth0_log_stream.tf line 11, in resource "auth0_log_stream" "log_stream":
  11: resource "auth0_log_stream" "log_stream" {
```

Changing the region to force a recreate also still fails, again without showing those extra properties:
```
  # auth0_log_stream.log_stream must be replaced
-/+ resource "auth0_log_stream" "log_stream" {
        aws_account_id           = (sensitive value)
      ~ aws_partner_event_source = "aws.partner/auth0.com/redmatter-dev01-6c98f657-24ad-4d72-86cf-d651537c1650/auth0.logs" -> (known after apply)
      ~ aws_region               = (sensitive value)
      + azure_partner_topic      = (known after apply)
      ~ id                       = "lst_0000000000001090" -> (known after apply)
        name                     = "Auth0Events"
      ~ status                   = "active" -> (known after apply)
        type                     = "eventbridge"
    }

Plan: 1 to add, 0 to change, 1 to destroy.
...
Error: 400 Bad Request: Payload validation error: 'Data does not match any schemas from 'oneOf''.

  on auth0_log_stream.tf line 11, in resource "auth0_log_stream" "log_stream":
  11: resource "auth0_log_stream" "log_stream" {
```
Though strangely in this case, when attempting to apply again, even though I would have thought Terraform would not think the resource has gone and start again, it fails again on creation:
```
  # auth0_log_stream.log_stream will be created
  + resource "auth0_log_stream" "log_stream" {
      + aws_account_id           = (sensitive value)
      + aws_partner_event_source = (known after apply)
      + aws_region               = (sensitive value)
      + azure_partner_topic      = (known after apply)
      + id                       = (known after apply)
      + name                     = "Auth0Events"
      + status                   = (known after apply)
      + type                     = "eventbridge"
    }
...
Error: 400 Bad Request: Payload validation error: 'Data does not match any schemas from 'oneOf''.

  on auth0_log_stream.tf line 11, in resource "auth0_log_stream" "log_stream":
  11: resource "auth0_log_stream" "log_stream" {
```
The only way to get it to all to work is to delete the resource in the Terraform code, apply, then reinstate the code and apply again.

I had a quick look and also couldn't see why this should be happening, though I expect it's something to do with the fact that these two properties are not strings like all the others.  Are they somewhere being set with `[]` and `false` instead of `null`?  I can have a closer look but wanted to get this done first.


One other small thing is that adding the computed values has had a slightly unexpected side-effect:
```
Terraform will perform the following actions:

  # auth0_log_stream.log_stream will be created
  + resource "auth0_log_stream" "log_stream" {
      + id     = (known after apply)
      + name   = "Auth0Events"
      + status = (known after apply)
      + type   = "eventbridge"

      + sink {
          + aws_account_id           = (sensitive value)
          + aws_partner_event_source = (known after apply)
          + aws_region               = (sensitive value)
          + azure_partner_topic      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
It's a little bit confusing that both `aws_partner_event_source` and `azure_partner_topic` show up even though only one of them should be set in the end, but I suppose that's a consequence of making these computed values available.

Sorry for the long comment and for seemingly being a bit too late with the PRs - I've just noticed it looks like you've also done the v5 merge.  I can try testing that as well if that's of any use.